app/controllers/custom_playlist_controller.rb

INSERT INTO "custom_playlists" ("user_id", "playlist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "alanbiju79"], ["playlist_id", "5wVbq2TenYjyavxvNX15nP"], ["created_at", "2019-10-05 09:22:00.624607"], ["updated_at", "2019-10-05 09:22:00.624607"]]
---
  def create_playlist
    songs = []

    $spotify_user.top_artists(time_range: 'short_term', limit: 5).each do |artist|
       artist.related_artists.first(6).each do |i|
         if songs.exclude? i.top_tracks(:US).first.uri
           songs << i.top_tracks(:US).first.uri
         end
       end
    end

    songs.join(",")
    playlist = $spotify_user.create_playlist!('Discovery')
    playlist.add_tracks!(songs)

    CustomPlaylist.new(user_id: $spotify_user.display_name, playlist_id: playlist.id).save

SELECT  1 AS one FROM "custom_playlists" WHERE "custom_playlists"."user_id" = $1 LIMIT $2  [["user_id", "alanbiju79"], ["LIMIT", 1]]
---
  def already_exists?
    if CustomPlaylist.exists?(user_id: $spotify_user.display_name)