app/controllers/home_controller.rb

SELECT  1 AS one FROM "custom_playlists" WHERE "custom_playlists"."user_id" = $1 LIMIT $2  [["user_id", "alanbiju79"], ["LIMIT", 1]]
---
  def created_playlist?
    if CustomPlaylist.exists?(user_id: $spotify_user.display_name)

SELECT  1 AS one FROM "custom_playlists" WHERE "custom_playlists"."playlist_id" = $1 LIMIT $2  [["playlist_id", "3BHMV8dxRPOXmRlgjP7gL8"], ["LIMIT", 1]]
---
  def created_by_us?(playlist)
    if CustomPlaylist.exists?(playlist_id: playlist)

SELECT  1 AS one FROM "custom_playlists" WHERE "custom_playlists"."playlist_id" = $1 LIMIT $2  [["playlist_id", "6VOYSWLPrBMh1VHxddKfp1"], ["LIMIT", 1]]
DELETE FROM "custom_playlists" WHERE "custom_playlists"."id" = $1  [["id", 8]]
SELECT "custom_playlists".* FROM "custom_playlists" WHERE "custom_playlists"."user_id" = $1  [["user_id", "alanbiju79"]]
---
  def check_custom_playlist
    exists = false

    @playlists.each do |x|
      if CustomPlaylist.exists?(playlist_id: x.id)
        exists = true
      end
    end

    if exists == false
      CustomPlaylist.where(user_id: $spotify_user.display_name).destroy_all